import React, { useState } from "react";

const Song = () => {
  const [isReading, setIsReading] = useState(null);
  const [videoIndex, setVideoIndex] = useState(null);
  // 假資料;
  const videoList = [
    {
      src: "https://www.youtube.com/embed/wjFVPJZvG6c?si=EHTsHYE7opFgLru8",
      name: "ยิ้มทั้งน้ำตา",
      singer: "Billkin",
      lyric: `
歌詞翻譯：พี่ ก้อง-Line社群-泰語學習群（語言，影視，旅遊，留學）
     
Billkin - ยิ้มทั้งน้ำตา (Official MV)(眼淚陪你流淚)

เราไม่เข้ากันเลย เธอก็รู้สึกหรือเปล่า
(你我之間已產生質變了，你難道沒發現嗎?)
ไม่อยากต้องฝืนใจที่ขัดขืน เพราะว่ามันไม่ใช่เรา
(這一切都已經變了，我已經不想再堅持下去)
ปรับตัวไม่ช่วยเลย ปรับกี่ครั้งก็เหมือนเก่า
(無論試圖改變幾次，似乎仍無疾而終)
มันคงถึงวันที่เราต้องฟัง
เพราะใจที่พังกำลังส่งเสียงดัง
(已到了你我須坦承面對的時刻，因為那疲累的心已無情的吶喊中)
ให้เราบอกลา มันคงไม่เป็นไร
เพราะเรายังมีวันที่ผ่านมา
ให้เธอและฉันได้มองกลับไป
(倘若要我說出分手，我也能接受，因為我還有昔日那些點滴可以讓你我回眸回味))
ถึงผ่านมาแล้ว ไม่มีวันผ่านไปอยู่ในนี้
(即便往事已逝，覆水已難收)
เสียงที่เธอบอกรักกันมันยังดังข้างในใจ
(但你口中說的愛依舊扎入我的心坎)
ยังมีวันวานให้เราได้คิดถึงตลอด
(你我還有那些往事可以回味)
แม้เรื่องเราจบไป แค่ได้คิดถึงมันก็พอ
(雖然一切劃下休止符，但能無限的想念就已足夠)
และจะไม่มีวันลืม รอยยิ้มที่สวยที่สุด
(昔日那燦開的笑容，是世上最美最難讓人無法忘懷的美景)
กอดนั้นช่างแสนอบอุ่น ทุกๆ ช่วงเวลา ยังคงยิ้มทั้งน้ำตา
(擁抱那笑容溫暖整個心懷，每一個時刻都是含著眼淚帶著微笑告別)`,
    },
    {
      src: "https://www.youtube.com/embed/O-QWKCcbRFg?si=7nJ6-AMlhnP5SKJv",
      name: "1000stars",
      singer: "กัน นภัทร",
      lyric: ` 
歌詞翻譯：พี่ ก้อง-Line社群-泰語學習群（語言，影視，旅遊，留學）
   
1000 stars-一千顆星 กัน นภัทร

ไม่เหมือนกับคนที่เคยฝันใฝ่
และตัวฉันก็คงไม่ใช่ใครคนนั้น
(你並非是我的白馬王子，而我似乎也不是你的白雪公主)
แต่เมื่อได้พบเหมือนเรานั้นเคย
เคยพบเจอในฝัน
(但你我是否曾相夢一場呢??)
หัวใจฉันเป็นไม่เหมือนเดิมเมื่อใกล้เธอ
 (當我那顆心靠近你時，卻不自覺產生了化學變化)
เสี้ยวนาทีที่ใกล้กับเธอโลกนี้ก็เปลี่ยน
(僅只一眼瞬間世界卻沸騰了)
แค่มีเธออยู่เคียงต้องการแค่เพียงเท่านั้น
(只要有你的陪伴，我..什麼都不求)
ไม่อาจหาเหตุผลข้อไหนไม่มีสิ่งใดยืนยัน
(這一切找不到理由也找不到答案)
ทุกเรื่องระหว่างเรานั้นมันคืออะไร
 (你我之間究竟發生什麼事?)
ดังนิทานที่เล่ากี่ครั้งก็ยังเหมือนเดิม
(就像千篇一律的的故事一樣，始終結局不會改變)
นั้นคือฉันรักเธอรักเธอไม่เคยเปลี่ยนผันไป
(我對你的愛經過宿世也不曾抹滅過)
หากดาวได้ยินคำอธิษฐานของหัวใจ
(倘若千星們能聽到我肺腑之祈禱)
กี่พันครั้งก็ยังจะขอให้ดวงใจฉันอยู่ใกล้เธอ
(無論千次萬次我都願意將我的心託付)`,
    },
    {
      src: "https://www.youtube.com/embed/O8sp-JThQCA?si=bGVPl2k5Mft4Dx8d",
      name: "มีปัญหาปรึกษาดาว",
      singer: "SERIOUS BACON",
      lyric: `
歌詞翻譯：1x 

有問題就問星星มีปัญหาปรึกษาดาว-SERIOUS BACON

ไม่รู้เลยว่าเธอ ป่านนี้เป็นอย่างไร
不知道你現在如何
ในวันที่เราต้องไกล
在我們必須分離的那天
อยากรู้เธอเจอใคร คนนั้นแล้วใช่ไหม
想知道你遇見誰 是那個人對嗎？
แต่ฉันคงไม่มีสิทธิ์จะโทรไปถาม
但我可能沒理由打電話問你
จะฝากข้อความ เป็นห่วงว่าเธออยู่ไหน เป็นเช่นไร
會傳簡訊問你 你在哪 過得好嗎？
ในค่ำคืนเงียบเหงาที่มีแค่ดาว
在只有星星相伴的寂寥之夜
เธอรู้หรือเปล่า ว่ามีใครคิดถึงเธอ
你知道有誰思念著你嗎？
ฝากให้ดาวบนฟ้า โปรดช่วยฉันหน่อยนะ
只能拜託天上的星點 就幫我一下吧
ฝากถามว่าตอนนี้ เธอเป็นอย่างไร
問問現在的你 過得如何
คิดถึงกันบ้างไหม ส่วนฉันทำอะไรไม่ได้เลย
也思念著我嗎 雖然我無能為力
ทำได้แค่ฝากให้ดาว ไปบอกเธอ
能做到的只有請求星星 去告訴你
ไม่รู้เลยว่าเธอ ป่านนี้เป็นอย่างไร
不知道你現在過得如何
ส่วนฉันยังไม่ไปไหน
即便我何處都沒去
บางครั้งเมื่อหลับตา ในใจก็เผลอคิดไป
有時我闔上眼時 心裡仍不免
ว่าเธอยังอยู่ข้างกัน
去想著你還在我身邊
ฝากให้ดาวบนฟ้า (ให้ดาวบนฟ้า)
請求天上的星星
โปรดช่วยฉันหน่อยนะ (ช่วยฉันหน่อยนะ)
幫我一下吧
ฝากถามว่าตอนนี้ เธอเป็นอย่างไร
幫我問問現在的你 過得如何
คิดถึงกันบ้างไหม (คิดถึงกันบ้างไหม)
是否也思念著我
ส่วนฉันทำอะไรไม่ได้เลย
即使我什麼都做不到
ทำได้แค่ฝากให้ดาว ไปบอกเธอ
唯一能做的只有請星星去告訴你
ฝากให้ดาวบนฟ้า (ให้ดาวบนฟ้า)
請求天上的星星
โปรดช่วยฉันหน่อยนะ (ช่วยฉันหน่อยนะ)
幫我一下吧
ฝากถามว่าตอนนี้ เธอเป็นอย่างไร
問一下現在的你 過得如何
คิดถึงกันบ้างไหม (คิดถึงกันบ้างไหม)
是否也思念著我
ส่วนฉันทำอะไรไม่ได้เลย
即使我什麼都做不到
ทำได้แค่ฝากให้ดาว
唯一能做的只有請求星星
อยู่ข้างเธอได้ไหม (อยู่ข้างเธอได้ไหม)
能否待在你身旁
อย่าให้เธอต้องเหงา (อย่าให้เธอต้องเหงา)
不想讓你感到孤寂
เพราะฉันกลัวว่าเขา ทำเธอเสียใจ
因為我害怕他 會讓你傷心
อยากพบเธออีกครั้ง (อยากพบเธออีกครั้ง)
想再一次見到你
เพราะฉันทำอะไรไม่ได้เลย
因為我什麼都辦不到
ทำได้แค่ฝากให้ดาว ไปบอกเธอ
唯一能做到的只有請星星 去告訴你
อยากพบเธออีกครั้ง
想再一次遇見你
จะไม่ยอมให้เธอไปไหน
不想再讓你去任何地方
ฉันคิดถึง จนแทบทนไม่ไหว
我想你 想到無所適從
แต่ทำได้แค่ฝากให้ดาว ไปกอดเธอ
但能做到的只有讓星星 去擁抱你
`,
    },
  ];

  const clickVideoBlock = (index) => {
    setIsReading(true);
    setVideoIndex(index);
  };
  const onClose = () => {
    setIsReading(false);
    setVideoIndex(null);
  };
  return (
    <div className="container">
      <section className="title">
        <h2>泰好聽-歌曲推薦</h2>
      </section>
      <section className="videoListBlock">
        {videoList.map((video, index) => (
          <div
            className="videoBlock"
            key={index}
            onClick={() => clickVideoBlock(index)}
          >
            <iframe
              src={video.src}
              title="YouTube video player"
              frameBorder="0"
              allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
              allowFullScreen
            ></iframe>
            <p>點擊可查看歌詞</p>
            <div className="videoName">{video.name}</div>
            <div className="singer">{video.singer}</div>
            <hr />
          </div>
        ))}
      </section>
      {isReading && videoList[videoIndex] && (
        <div className="videoDetailsBg">
          <section className="videoDetailsBlock">
            <button className="xMark" onClick={() => onClose()}>
              <i className="fa-solid fa-xmark fa-2xl"></i>
            </button>
            <h2 className="videoName">{videoList[videoIndex].name}</h2>
            <h2 className="singer">{videoList[videoIndex].singer}</h2>
            <iframe
              src={videoList[videoIndex].src}
              title="YouTube video player"
              frameBorder="0"
              allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
              allowFullScreen
            ></iframe>
            <hr />
            <pre className="lyric">{videoList[videoIndex].lyric}</pre>
          </section>
        </div>
      )}
    </div>
  );
};

export default Song;
